app/controllers/user_controller.rb

  def create
    @user = User.create(username: params[:username],email: params[:email],password: params[:password])
---
INSERT INTO "users" ("username", "email", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["username", "Mathieu"], ["email", "pierrefeuille@gmail.com"], ["password", "66661789"], ["created_at", "2018-11-01 08:29:04.894967"], ["updated_at", "2018-11-01 08:29:04.894967"]]

  def show
  	@username = User.find_by(username: params[:username]).username
  	@email = User.find_by(username: params[:username]).email
---
SELECT  "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "Pierre"], ["LIMIT", 1]]